# 1. Matplotlib

In [1]:
import matplotlib.pyplot as plt

# 2. Dictionaries

### 2.1. CRUD

#### Create

In [2]:
my_dict = {'Name': 'John Paul M. Curada', 
           'School': 'Honorato C. Perez, Sr. Memorial Science High School',
           'Grade level': 12,
           'Section':'Stephenson'
          }

my_dict

{'Name': 'John Paul M. Curada',
 'School': 'Honorato C. Perez, Sr. Memorial Science High School',
 'Grade level': 12,
 'Section': 'Stephenson'}

#### Read

In [3]:
# Access a single element
my_dict['School']

'Honorato C. Perez, Sr. Memorial Science High School'

In [4]:
# Get the key and value within the dictionary 
my_dict.items()

dict_items([('Name', 'John Paul M. Curada'), ('School', 'Honorato C. Perez, Sr. Memorial Science High School'), ('Grade level', 12), ('Section', 'Stephenson')])

In [5]:
# Get all of the keys of a dictionary
my_dict.keys()

dict_keys(['Name', 'School', 'Grade level', 'Section'])

In [6]:
# Get all of the values of a dictionary
my_dict.values()

dict_values(['John Paul M. Curada', 'Honorato C. Perez, Sr. Memorial Science High School', 12, 'Stephenson'])

In [7]:
# Accessing dictionary with F-string (formatted string)
f"{my_dict['Name']} is from {my_dict['Grade level']} {my_dict['Section']}"

'John Paul M. Curada is from 12 Stephenson'

In [8]:
# Checking if the specified key is in the dictionary
print('Age' in my_dict) # --> will return False
print('Name' in my_dict) # --> will return True

False
True

#### Update

In [9]:
# Add a key and a value to an existing dictionary
my_dict['Strand'] = 'STEM'
my_dict

{'Name': 'John Paul M. Curada',
 'School': 'Honorato C. Perez, Sr. Memorial Science High School',
 'Grade level': 12,
 'Section': 'Stephenson',
 'Strand': 'STEM'}

In [10]:
# Changing the value of a key
my_dict['Name'] = 'JP Curada'
my_dict

{'Name': 'JP Curada',
 'School': 'Honorato C. Perez, Sr. Memorial Science High School',
 'Grade level': 12,
 'Section': 'Stephenson',
 'Strand': 'STEM'}

In [11]:
# Dictionary as a value

strengths = {'Math':'Algebra',
             'Science': 'Stoichiometry',
             'Language': 'Filipino'
            }

my_dict['Academic_strengths'] = strengths

print(my_dict)
print('')
print(my_dict['Academic_strengths'])
print('')
print(my_dict['Academic_strengths']['Math'])
print('')
print(my_dict['Academic_strengths']['Science'])

{'Name': 'JP Curada', 'School': 'Honorato C. Perez, Sr. Memorial Science High School', 'Grade level': 12, 'Section': 'Stephenson', 'Strand': 'STEM', 'Academic_strengths': {'Math': 'Algebra', 'Science': 'Stoichiometry', 'Language': 'Filipino'}}

{'Math': 'Algebra', 'Science': 'Stoichiometry', 'Language': 'Filipino'}

Algebra

Stoichiometry

#### Delete

In [12]:
# Delete a key 
del(my_dict['Section'])
my_dict

{'Name': 'JP Curada',
 'School': 'Honorato C. Perez, Sr. Memorial Science High School',
 'Grade level': 12,
 'Strand': 'STEM',
 'Academic_strengths': {'Math': 'Algebra',
  'Science': 'Stoichiometry',
  'Language': 'Filipino'}}

### 2.2. Convert Dictionaries to another data types

In [13]:
# Dictionary to list
print(list(my_dict)) # --> List of keys
print('')
print(list(my_dict.values())) # --> List of values

['Name', 'School', 'Grade level', 'Strand', 'Academic_strengths']

['JP Curada', 'Honorato C. Perez, Sr. Memorial Science High School', 12, 'STEM', {'Math': 'Algebra', 'Science': 'Stoichiometry', 'Language': 'Filipino'}]

In [14]:
# Dictionary to set
print(set(my_dict)) # --> List of keys
print('')

# Since the values of this key is a dictionary, it would cause a problem in iteration for converting to set. 
del(my_dict['Academic_strengths']) 

print(set(my_dict.values())) # --> List of values

{'Strand', 'Name', 'Grade level', 'School', 'Academic_strengths'}

{'STEM', 'Honorato C. Perez, Sr. Memorial Science High School', 12, 'JP Curada'}

In [17]:
# Combining two lists with the same len to a dictionary
keys = ['Name', 'School', 'Grade level', 'Strand', 'Academic_strengths']
vals = ['JP Curada', 'Honorato C. Perez, Sr. Memorial Science High School', 12, 'STEM', {'Math': 'Algebra', 'Science': 'Stoichiometry', 'Language': 'Filipino'}]

converted_dict = dict(zip(keys,vals))
converted_dict

{'Name': 'JP Curada',
 'School': 'Honorato C. Perez, Sr. Memorial Science High School',
 'Grade level': 12,
 'Strand': 'STEM',
 'Academic_strengths': {'Math': 'Algebra',
  'Science': 'Stoichiometry',
  'Language': 'Filipino'}}

### 2.3. Dictionary Comprehension

# 3. Pandas

In [21]:
import pandas as pd

### 3.1. CRUD

#### Create

In [28]:
my_grades = pd.DataFrame({'Subjects':['Chemistry I', 'Physics I', 'Statistics', 'Mathematics II', 'Calculus', 'Filipino', 'English'],
                          'Grades': [91, 93, 96, 95, 94, 89, 90]
                         }
                        )

my_grades

         Subjects  Grades
0     Chemistry I      91
1       Physics I      93
2      Statistics      96
3  Mathematics II      95
4        Calculus      94
5        Filipino      89
6         English      90

In [29]:
# Assign index values
my_grades.index = ['CHEM', 'PHY','STAT','MATH','CALC', 'FIL', 'ENG']
my_grades

            Subjects  Grades
CHEM     Chemistry I      91
PHY        Physics I      93
STAT      Statistics      96
MATH  Mathematics II      95
CALC        Calculus      94
FIL         Filipino      89
ENG          English      90

#### Read

In [31]:
# Show the first N
my_grades.head(5) # --> N = 5 (First 5)

            Subjects  Grades
CHEM     Chemistry I      91
PHY        Physics I      93
STAT      Statistics      96
MATH  Mathematics II      95
CALC        Calculus      94

In [33]:
# Show the DataFrame information
my_grades.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, CHEM to ENG
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Subjects  7 non-null      object
 1   Grades    7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 168.0+ bytes

In [34]:
# Show the column headers
my_grades.columns

Index(['Subjects', 'Grades'], dtype='object')

In [37]:
# Access the 'Grades' column
my_grades.Grades

CHEM    91
PHY     93
STAT    96
MATH    95
CALC    94
FIL     89
ENG     90
Name: Grades, dtype: int64

In [39]:
# Show the frequency of each values
my_grades.value_counts()

Subjects        Grades
Calculus        94        1
Chemistry I     91        1
English         90        1
Filipino        89        1
Mathematics II  95        1
Physics I       93        1
Statistics      96        1
dtype: int64

In [41]:
# Show the DataFrame's Descriptive Statistics
my_grades.describe()

          Grades
count   7.000000
mean   92.571429
std     2.636737
min    89.000000
25%    90.500000
50%    93.000000
75%    94.500000
max    96.000000

In [63]:
my_grades

            Subjects  Grades
CHEM     Chemistry I      91
PHY        Physics I      93
STAT      Statistics      96
MATH  Mathematics II      95
CALC        Calculus      94
FIL         Filipino      89
ENG          English      90

In [72]:
# Accessing my grade in Chemistry I through loc function (label based location)
my_grades.loc['CHEM', 'Grades']

91

In [77]:
my_grades.loc['CHEM':'MATH', 'Grades']

CHEM    91
PHY     93
STAT    96
MATH    95
Name: Grades, dtype: int64

In [73]:
# Accessing my grade in Chemistry I through iloc function (integer positional location)
my_grades.iloc[0,1]

91

#### Update

#### Delete

### 3.2. Filtering Pandas DataFrame
1. Select the column (series) that you want to use with comparison operators
2. Apply an comparison operator at that column
3. Subset that column into the original df

In [46]:
# Pandas Series selection
grades_series = my_grades['Grades']
type(grades_series)

pandas.core.series.Series

In [52]:
# Getting the mean
mean = grades_series.values.mean()

In [55]:
grades_bool = grades_series > mean
grades_bool

CHEM    False
PHY      True
STAT     True
MATH     True
CALC     True
FIL     False
ENG     False
Name: Grades, dtype: bool

In [56]:
# Subset it into the my_grades df
my_grades[grades_bool] # --> This will show the subjects that has a grade greater than the mean

            Subjects  Grades
PHY        Physics I      93
STAT      Statistics      96
MATH  Mathematics II      95
CALC        Calculus      94

In [60]:
# Do it with one-liner code
above_the_mean_df = my_grades[my_grades['Grades'] > my_grades['Grades'].values.mean()]
above_the_mean_df

            Subjects  Grades
PHY        Physics I      93
STAT      Statistics      96
MATH  Mathematics II      95
CALC        Calculus      94

### 3.3. Converting Pandas DataFrame to another file formats

### 4. Loop Data Structures

### Looping within a List

### Looping within a Dictionary

In [62]:
years = [year for year in range(2011, 2021)]
years

[2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020]

### Looping within a Numpy Array

### Looping over a Pandas DataFrame